Revit 2024 API
UISaveAsOptions Class
 This class contains UI options available for saving a document to disk with a new filename.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class UISaveAsOptions : IDisposable
Visual Basic
Public Class UISaveAsOptions _
	Implements IDisposable
Visual C++
public ref class UISaveAsOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UISaveAsOptions
See Also
UISaveAsOptions Members
Autodesk.Revit.UI Namespace